# ProgressDlgOpen

## Description
Show a progress dialog that doesn't interrupt the script. ProgressDlgClose must be used to close the dialog.

```pascal
PROCEDURE ProgressDlgOpen(
				title     : STRING;
				canCancel : BOOLEAN);
```

```python

def vs.ProgressDlgOpen(title, canCancel):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|title|STRING||
|canCancel|BOOLEAN||

## Version
Availability: from Vectorworks 2015
## Category
* Utility